Repository: vinigalantine/dio-dotnet-fundamentals-parking-lot-challenge
Catalog: ParkingLot.Common/Resources/Messages.*.resx
Languages: pt_br

# WelcomeMessage
source: Welcome to Parking Lot!
pt_br: Bem-vindo(a) ao sistema de estacionamento!

# PromptInitialPrice
source: Enter the initial price:
pt_br: Digite o preço inicial:

# PromptPricePerHour
source: Now enter the price per hour:
pt_br: Agora digite o preço por hora:

# MenuPrompt
source: Enter your option:
pt_br: Digite a sua opção:

# MenuOptionAdd
source: 1 - Register vehicle
pt_br: 1 - Cadastrar veículo

# MenuOptionRemove
source: 2 - Remove vehicle
pt_br: 2 - Remover veículo

# MenuOptionList
source: 3 - List vehicles
pt_br: 3 - Listar veículos

# MenuOptionExit
source: 4 - Exit
pt_br: 4 - Encerrar

# MenuInvalidOption
source: Invalid option
pt_br: Opção inválida

# PressAnyKey
source: Press any key to continue
pt_br: Pressione uma tecla para continuar

# GoodbyeMessage
source: The program has ended
pt_br: O programa se encerrou

# AskForVehicleLicensePlateToPark
source: Enter the license plate of the vehicle to park:
pt_br: Digite a placa do veículo para estacionar:

# LeaveOption
source: (Or use {0} to go back)
pt_br: (Ou use {0} para voltar)

# PleaseInformTheLicensePlateCorrectly
source: Invalid input, please provide a valid license plate
pt_br: Input inválido, por favor forneça uma placa:

# LicensePlateAlreadyParked
source: The vehicle with the provided license plate is already parked
pt_br: O veículo com a placa informada já se encontra no estacionamento

# VehicleParkedSuccessfully
source: The vehicle has been parked successfully!
pt_br: O veículo foi estacionado com sucesso!

source: Returning...
pt_br: Retornando...

# AskForVehicleLicensePlateToRemove
source: Enter the license plate of the vehicle to remove:
pt_br: Digite a placa do veículo para remover:

# VehicleNotFound
source: Sorry, this vehicle is not parked here. Please check if you entered the license plate correctly.
pt_br: Desculpe, esse veículo não está estacionado aqui. Confira se digitou a placa corretamente.

# AskHowManyHoursVehicleIsParked
source: Enter the number of hours the vehicle was parked:
pt_br: Informe a quantidade de horas que o veículo permaneceu estacionado:

source: Please provide the hours correctly
pt_br: Por favor forneça as horas corretamente

# VehicleRemovedAndTotalatoPay
source: The vehicle with license plate {1} has been removed and the total price was: $ {2}
pt_br: O veículo de placa {0} foi removido e o preço total foi de: R$ {1}
